[
  {
    "id": "1",
    "eventName": "KIN x GetCode Hackathon 2024",
    "eventDetails": "Join the ultimate blockchain-based hackathon where developers compete to build innovative solutions using KIN x GetCode's micropayment technology. Collaborate with like-minded innovators and present your projects to top judges in the blockchain space.",
    "date": "Friday, Oct 6th",
    "time": "9:00 AM - 9:00 PM",
    "imageLink": "/code.jpg"
  },
  {
    "id": "2",
    "eventName": "Building Decentralized Apps with KIN x GetCode",
    "eventDetails": "A hands-on workshop where developers dive into building decentralized applications (dApps) using KIN x GetCode's blockchain. Ideal for both new and experienced developers looking to explore blockchain integration in real-world projects.",
    "date": "Saturday, Oct 7th",
    "time": "2:00 PM - 5:00 PM",
    "imageLink": "/code.jpg"
  },
  {
    "id": "3",
    "eventName": "Blockchain for Micropayments: Tech Talk",
    "eventDetails": "An engaging talk on how KIN x GetCode is revolutionizing micropayments through blockchain. Learn about decentralized payment systems, security, and future applications for blockchain in everyday digital transactions.",
    "date": "Saturday, Oct 7th",
    "time": "10:00 AM - 12:00 PM",
    "imageLink": "/code.jpg"
  },

  {
    "id": "4",
    "eventName": "KIN x GetCode Networking Night",
    "eventDetails": "An evening of networking with top blockchain professionals, investors, and developers. Share ideas, discover new opportunities, and explore partnerships within the KIN x GetCode ecosystem.",
    "date": "Saturday, Oct 7th",
    "time": "6:00 PM - 9:00 PM",
    "imageLink": "/code.jpg"
  },
  {
    "id": "5",
    "eventName": "Future of Micropayments: Expert Panel",
    "eventDetails": "Join an expert panel discussion featuring blockchain leaders discussing the future of micropayments, the challenges ahead, and how KIN x GetCode is leading the charge in transforming the digital economy.",
    "date": "Sunday, Oct 8th",
    "time": "11:00 AM - 1:00 PM",
    "imageLink": "/code.jpg"
  },
  {
    "id": "6",
    "eventName": "KIN x GetCode Developer Conference",
    "eventDetails": "A full-day conference featuring keynote speakers, panel discussions, and breakout sessions focused on blockchain development, payment solutions, and the latest advancements in KIN x GetCode technology.",
    "date": "Sunday, Oct 8th",
    "time": "9:00 AM - 6:00 PM",
    "imageLink": "/code.jpg"
  }
]
